#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
aws_vpc.this: Refreshing state... [id=vpc-0aa4cc4ac16c41ac5]
aws_iam_role.rds_monitoring_role: Refreshing state... [id=app-12-rds-monitoring-role]
aws_db_parameter_group.postgres: Refreshing state... [id=app-12]
aws_kms_key.encryption_rds: Refreshing state... [id=18745d51-8ae7-487b-8965-9182a3713747]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
aws_kms_alias.encryption_rds: Refreshing state... [id=alias/app-12-kms]
data.aws_iam_policy_document.encryption_rds_policy: Reading...
data.aws_iam_policy_document.encryption_rds_policy: Read complete after 0s [id=55640325]
aws_kms_key_policy.encryption_rds: Refreshing state... [id=18745d51-8ae7-487b-8965-9182a3713747]
aws_iam_role_policy_attachment.managed_rds_monitoring_policy_attachement: Refreshing state... [id=app-12-rds-monitoring-role-20240918115443664100000001]
aws_route_table.this_rt: Refreshing state... [id=rtb-0c945e2224f691d43]
aws_security_group.rds: Refreshing state... [id=sg-067357756b9c4e723]
aws_default_security_group.default: Refreshing state... [id=sg-0d6a9c85ccd9e8332]
aws_subnet.db[0]: Refreshing state... [id=subnet-08dfe32d3e9207cde]
aws_subnet.db[1]: Refreshing state... [id=subnet-07a6703bdcb69773d]
aws_security_group_rule.ingress_rds_sg: Refreshing state... [id=sgrule-1404705294]
aws_security_group_rule.egress_rds_sg: Refreshing state... [id=sgrule-1208955154]
aws_route_table_association.db[1]: Refreshing state... [id=rtbassoc-0eb47d866219ca61c]
aws_route_table_association.db[0]: Refreshing state... [id=rtbassoc-0edfc6c234837978c]
aws_db_subnet_group.rds: Refreshing state... [id=app-12-subnet-group]
aws_db_instance.postgresql: Refreshing state... [id=db-QTNQB674NL2XBVTWP3ARC7AS2M]
aws_ssm_parameter.rds_connection: Refreshing state... [id=/app-12/rds-connection]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_db_parameter_group.postgres will be updated in-place
  ~ resource "aws_db_parameter_group" "postgres" {
        id           = "app-12"
        name         = "app-12"
        tags         = {}
        # (5 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "rds.force_ssl" -> null
          - value        = "1" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "rds.force_ssl"
          + value        = "1"
        }

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.ssm_parameter_policy will be created
  + resource "aws_iam_policy" "ssm_parameter_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to read the RDS Endpoint and Password ARN stored in the SSM Parameter Store."
      + id               = (known after apply)
      + name             = "app-12-rds-connection-read-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-2:743794601996:parameter/app-12/rds-connection",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:kms:us-east-2:743794601996:key/18745d51-8ae7-487b-8965-9182a3713747",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Source" = "https://github.com/kunduso/rds-secretsmanager-rotation-lambda-terraform"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*